var store = [{
        "title": "[프로그래머스] Lv3. 빙고",
        "excerpt":"빙고 Lv3 문제 빙고는 NxN 크기의 게임 보드 칸에 1부터 NxN까지의 자연수를 중복 없이 하나씩 적은 후 숫자를 하나씩 지워나가는 게임입니다. 이때, 가로, 세로, 대각선 방향으로 한 줄에 적힌 숫자를 모두 지울 경우 빙고를 1개 만들었다고 합니다. 다음은 4X4 크기의 게임 보드를 이용해 게임을 진행한 예시입니다. 위와 같이 각 칸에...","categories": ["Programmers"],
        "tags": ["Algorithm","Coding Test","Python"],
        "url": "/programmers/bingo/",
        "teaser": null
      },{
        "title": "[백준][13305] 주유소",
        "excerpt":"주유소 난이도 실버 3 문제 어떤 나라에 N개의 도시가 있다. 이 도시들은 일직선 도로 위에 있다. 편의상 일직선을 수평 방향으로 두자. 제일 왼쪽의 도시에서 제일 오른쪽의 도시로 자동차를 이용하여 이동하려고 한다. 인접한 두 도시 사이의 도로들은 서로 길이가 다를 수 있다. 도로 길이의 단위는 km를 사용한다. 처음 출발할 때 자동차에는...","categories": ["BOJ"],
        "tags": ["Algorithm","Coding Test","C++"],
        "url": "/boj/13305/",
        "teaser": null
      },{
        "title": "[백준][1946] 신입 사원 (작성 중)",
        "excerpt":"신입 사원  난이도       실버 1    문제   입력   출력   결과   문제풀이   채점 결과  ","categories": ["BOJ"],
        "tags": ["Algorithm","Coding Test","C++"],
        "url": "/boj/1946/",
        "teaser": null
      },{
        "title": "[백준][2468] 안전 영역 (작성 중)",
        "excerpt":"안전 영역 난이도 실버 1 문제 재난방재청에서는 많은 비가 내리는 장마철에 대비해서 다음과 같은 일을 계획하고 있다. 먼저 어떤 지역의 높이 정보를 파악한다. 그 다음에 그 지역에 많은 비가 내렸을 때 물에 잠기지 않는 안전한 영역이 최대로 몇 개가 만들어 지는 지를 조사하려고 한다. 이때, 문제를 간단하게 하기 위하여, 장마철에...","categories": ["BOJ"],
        "tags": ["Algorithm","Coding Test","C++"],
        "url": "/boj/2468/",
        "teaser": null
      }]
