var store = [{
        "title": "[프로그래머스] Lv3. 빙고",
        "excerpt":"빙고 Lv3 문제 빙고는 NxN 크기의 게임 보드 칸에 1부터 NxN까지의 자연수를 중복 없이 하나씩 적은 후 숫자를 하나씩 지워나가는 게임입니다. 이때, 가로, 세로, 대각선 방향으로 한 줄에 적힌 숫자를 모두 지울 경우 빙고를 1개 만들었다고 합니다. 다음은 4X4 크기의 게임 보드를 이용해 게임을 진행한 예시입니다. 위와 같이 각 칸에...","categories": ["Programmers"],
        "tags": ["Algorithm","Coding Test","Python"],
        "url": "/programmers/bingo/",
        "teaser": null
      },{
        "title": "[백준][13305] 주유소",
        "excerpt":"주유소 난이도 실버 3 문제 어떤 나라에 N개의 도시가 있다. 이 도시들은 일직선 도로 위에 있다. 편의상 일직선을 수평 방향으로 두자. 제일 왼쪽의 도시에서 제일 오른쪽의 도시로 자동차를 이용하여 이동하려고 한다. 인접한 두 도시 사이의 도로들은 서로 길이가 다를 수 있다. 도로 길이의 단위는 km를 사용한다. 처음 출발할 때 자동차에는...","categories": ["BOJ"],
        "tags": ["Algorithm","Greedy","C++"],
        "url": "/boj/13305/",
        "teaser": null
      },{
        "title": "[백준][1946] 신입 사원",
        "excerpt":"신입 사원 난이도 실버 1 문제 언제나 최고만을 지향하는 굴지의 대기업 진영 주식회사가 신규 사원 채용을 실시한다. 인재 선발 시험은 1차 서류심사와 2차 면접시험으로 이루어진다. 최고만을 지향한다는 기업의 이념에 따라 그들은 최고의 인재들만을 사원으로 선발하고 싶어 한다. 그래서 진영 주식회사는, 다른 모든 지원자와 비교했을 때 서류심사 성적과 면접시험 성적 중...","categories": ["BOJ"],
        "tags": ["Algorithm","Greedy","C++"],
        "url": "/boj/1946/",
        "teaser": null
      },{
        "title": "[백준][2468] 안전 영역",
        "excerpt":"안전 영역 난이도 실버 1 문제 재난방재청에서는 많은 비가 내리는 장마철에 대비해서 다음과 같은 일을 계획하고 있다. 먼저 어떤 지역의 높이 정보를 파악한다. 그 다음에 그 지역에 많은 비가 내렸을 때 물에 잠기지 않는 안전한 영역이 최대로 몇 개가 만들어 지는 지를 조사하려고 한다. 이때, 문제를 간단하게 하기 위하여, 장마철에...","categories": ["BOJ"],
        "tags": ["Algorithm","BFS","C++"],
        "url": "/boj/2468/",
        "teaser": null
      },{
        "title": "[백준][1149] RGB 거리",
        "excerpt":"RGB 거리 난이도 실버 1 문제 RGB거리에는 집이 N개 있다. 거리는 선분으로 나타낼 수 있고, 1번 집부터 N번 집이 순서대로 있다. 집은 빨강, 초록, 파랑 중 하나의 색으로 칠해야 한다. 각각의 집을 빨강, 초록, 파랑으로 칠하는 비용이 주어졌을 때, 아래 규칙을 만족하면서 모든 집을 칠하는 비용의 최솟값을 구해보자. 1번 집의...","categories": ["BOJ"],
        "tags": ["Algorithm","DP","C++"],
        "url": "/boj/1149/",
        "teaser": null
      },{
        "title": "[백준][7562] 나이트의 이동",
        "excerpt":"나이트의 이동 난이도 실버 1 문제 체스판 위에 한 나이트가 놓여져 있다. 나이트가 한 번에 이동할 수 있는 칸은 아래 그림에 나와있다. 나이트가 이동하려고 하는 칸이 주어진다. 나이트는 몇 번 움직이면 이 칸으로 이동할 수 있을까? 입력 입력의 첫째 줄에는 테스트 케이스의 개수가 주어진다. 각 테스트 케이스는 세 줄로 이루어져...","categories": ["BOJ"],
        "tags": ["Algorithm","BFS","C++"],
        "url": "/boj/7562/",
        "teaser": null
      },{
        "title": "[백준][2583] 영역 구하기",
        "excerpt":"영역 구하기 난이도 실버 1 문제 눈금의 간격이 1인 M×N(M,N≤100)크기의 모눈종이가 있다. 이 모눈종이 위에 눈금에 맞추어 K개의 직사각형을 그릴 때, 이들 K개의 직사각형의 내부를 제외한 나머지 부분이 몇 개의 분리된 영역으로 나누어진다. 예를 들어 M=5, N=7 인 모눈종이 위에 &lt;그림 1&gt;과 같이 직사각형 3개를 그렸다면, 그 나머지 영역은 &lt;그림...","categories": ["BOJ"],
        "tags": ["Algorithm","BFS","C++"],
        "url": "/boj/2583/",
        "teaser": null
      },{
        "title": "[백준][16953] A → B",
        "excerpt":"A → B 난이도 실버 2 문제 정수 A를 B로 바꾸려고 한다. 가능한 연산은 다음과 같은 두 가지이다. 2를 곱한다. 1을 수의 가장 오른쪽에 추가한다. A를 B로 바꾸는데 필요한 연산의 최솟값을 구해보자. 입력 첫째 줄에 A, B (1 ≤ A &lt; B ≤ \\(10^9\\))가 주어진다. 출력 A를 B로 바꾸는데 필요한...","categories": ["BOJ"],
        "tags": ["Algorithm","BFS","C++"],
        "url": "/boj/16953/",
        "teaser": null
      },{
        "title": "[프로그래머스] Lv2. 신고 결과 받기",
        "excerpt":"신고 결과 받기 문제 설명 신입사원 무지는 게시판 불량 이용자를 신고하고 처리 결과를 메일로 발송하는 시스템을 개발하려 합니다. 무지가 개발하려는 시스템은 다음과 같습니다. 각 유저는 한 번에 한 명의 유저를 신고할 수 있습니다. 신고 횟수에 제한은 없습니다. 서로 다른 유저를 계속해서 신고할 수 있습니다. 한 유저를 여러 번 신고할 수도...","categories": ["Programmers"],
        "tags": ["Algorithm","Coding Test","C++"],
        "url": "/programmers/singo/",
        "teaser": null
      },{
        "title": "[백준][1303] 전쟁 - 전투",
        "excerpt":"전쟁 - 전투 난이도 실버 1 문제 전쟁은 어느덧 전면전이 시작되었다. 결국 전투는 난전이 되었고, 우리 병사와 적국 병사가 섞여 싸우게 되었다. 그러나 당신의 병사들은 흰색 옷을 입고, 적국의 병사들은 파란색 옷을 입었기 때문에 서로가 적인지 아군인지는 구분할 수 있다. 문제는 같은 팀의 병사들은 모이면 모일수록 강해진다는 사실이다. N명이 뭉쳐있을...","categories": ["BOJ"],
        "tags": ["Algorithm","BFS","C++"],
        "url": "/boj/1303/",
        "teaser": null
      },{
        "title": "[백준][9095] 1,2,3 더하기",
        "excerpt":"1,2,3 더하기 난이도 실버 3 문제 정수 4를 1, 2, 3의 합으로 나타내는 방법은 총 7가지가 있다. 합을 나타낼 때는 수를 1개 이상 사용해야 한다. 1+1+1+1 1+1+2 1+2+1 2+1+1 2+2 1+3 3+1 정수 n이 주어졌을 때, n을 1, 2, 3의 합으로 나타내는 방법의 수를 구하는 프로그램을 작성하시오. 입력 첫째 줄에...","categories": ["BOJ"],
        "tags": ["Algorithm","DFS","DP","C++"],
        "url": "/boj/9095/",
        "teaser": null
      },{
        "title": "[백준][1991] 트리 순회",
        "excerpt":"트리 순회 난이도 실버 1 문제 이진 트리를 입력받아 전위 순회(preorder traversal), 중위 순회(inorder traversal), 후위 순회(postorder traversal)한 결과를 출력하는 프로그램을 작성하시오. 예를 들어 위와 같은 이진 트리가 입력되면, 전위 순회한 결과 : ABDCEFG // (루트) (왼쪽 자식) (오른쪽 자식) 중위 순회한 결과 : DBAECFG // (왼쪽 자식) (루트) (오른쪽...","categories": ["BOJ"],
        "tags": ["Algorithm","C++","Tree"],
        "url": "/boj/1991/",
        "teaser": null
      },{
        "title": "[백준][11660] 구간 합 구하기 5",
        "excerpt":"구간 합 구하기 5 난이도 실버 1 문제 N×N개의 수가 N×N 크기의 표에 채워져 있다. (x1, y1)부터 (x2, y2)까지 합을 구하는 프로그램을 작성하시오. (x, y)는 x행 y열을 의미한다. 예를 들어, N = 4이고, 표가 아래와 같이 채워져 있는 경우를 살펴보자. 1 2 3 4 2 3 4 5 3 4...","categories": ["BOJ"],
        "tags": ["Algorithm","C++","DP"],
        "url": "/boj/11660/",
        "teaser": null
      },{
        "title": "[백준][14502] 연구소",
        "excerpt":"연구소 난이도 골드 4 문제 인체에 치명적인 바이러스를 연구하던 연구소에서 바이러스가 유출되었다. 다행히 바이러스는 아직 퍼지지 않았고, 바이러스의 확산을 막기 위해서 연구소에 벽을 세우려고 한다. 연구소는 크기가 N×M인 직사각형으로 나타낼 수 있으며, 직사각형은 1×1 크기의 정사각형으로 나누어져 있다. 연구소는 빈 칸, 벽으로 이루어져 있으며, 벽은 칸 하나를 가득 차지한다. 일부...","categories": ["BOJ"],
        "tags": ["Algorithm","BFS","C++"],
        "url": "/boj/14502/",
        "teaser": null
      },{
        "title": "[백준][11726] 2xn 타일링",
        "excerpt":"2xn 타일링 난이도 실버 3 문제 2×n 크기의 직사각형을 1×2, 2×1 타일로 채우는 방법의 수를 구하는 프로그램을 작성하시오. 아래 그림은 2×5 크기의 직사각형을 채운 한 가지 방법의 예이다. 입력 첫째 줄에 n이 주어진다. (1 ≤ n ≤ 1,000) 출력 첫째 줄에 2×n 크기의 직사각형을 채우는 방법의 수를 10,007로 나눈 나머지를...","categories": ["BOJ"],
        "tags": ["Algorithm","C++","DP"],
        "url": "/boj/11726/",
        "teaser": null
      },{
        "title": "[백준][1987] 알파벳",
        "excerpt":"알파벳 난이도 골드 4 문제 세로 R칸, 가로 C칸으로 된 표 모양의 보드가 있다. 보드의 각 칸에는 대문자 알파벳이 하나씩 적혀 있고, 좌측 상단 칸 (1행 1열) 에는 말이 놓여 있다. 말은 상하좌우로 인접한 네 칸 중의 한 칸으로 이동할 수 있는데, 새로 이동한 칸에 적혀 있는 알파벳은 지금까지 지나온...","categories": ["BOJ"],
        "tags": ["Algorithm","C++","DFS"],
        "url": "/boj/1987/",
        "teaser": null
      },{
        "title": "[프로그래머스] 셔틀버스",
        "excerpt":"2018 KAKAO BLIND RECRUITMENT 셔틀버스 문제 카카오에서는 무료 셔틀버스를 운행하기 때문에 판교역에서 편하게 사무실로 올 수 있다. 카카오의 직원은 서로를 ‘크루’라고 부르는데, 아침마다 많은 크루들이 이 셔틀을 이용하여 출근한다. 이 문제에서는 편의를 위해 셔틀은 다음과 같은 규칙으로 운행한다고 가정하자. 셔틀은 09:00부터 총 n회 t분 간격으로 역에 도착하며, 하나의 셔틀에는 최대...","categories": ["Programmers"],
        "tags": ["Algorithm","C++","Implementation"],
        "url": "/programmers/shuttlebus/",
        "teaser": null
      },{
        "title": "[백준][1715] 카드 정렬하기",
        "excerpt":"카드 정렬하기 난이도 골드 4 문제 정렬된 두 묶음의 숫자 카드가 있다고 하자. 각 묶음의 카드의 수를 A, B라 하면 보통 두 묶음을 합쳐서 하나로 만드는 데에는 A+B 번의 비교를 해야 한다. 이를테면, 20장의 숫자 카드 묶음과 30장의 숫자 카드 묶음을 합치려면 50번의 비교가 필요하다. 매우 많은 숫자 카드 묶음이...","categories": ["BOJ"],
        "tags": ["Algorithm","C++","Greedy","Queue"],
        "url": "/boj/1715/",
        "teaser": null
      },{
        "title": "[백준][2293] 동전1",
        "excerpt":"동전 1 난이도 골드 5 문제 n가지 종류의 동전이 있다. 각각의 동전이 나타내는 가치는 다르다. 이 동전을 적당히 사용해서, 그 가치의 합이 k원이 되도록 하고 싶다. 그 경우의 수를 구하시오. 각각의 동전은 몇 개라도 사용할 수 있다. 사용한 동전의 구성이 같은데, 순서만 다른 것은 같은 경우이다. 입력 첫째 줄에 n,...","categories": ["BOJ"],
        "tags": ["Algorithm","C++","DP"],
        "url": "/boj/2293/",
        "teaser": null
      },{
        "title": "[백준][2527] 직사각형",
        "excerpt":"직사각형 난이도 실버 1 문제 2차원 격자공간에 두 개의 꼭짓점 좌표로 표현되는 직사각형이 있다. 직사각형은 아래와 같이 왼쪽 아래 꼭짓점 좌표 (x, y)와 오른쪽 위 꼭짓점 좌표 (p, q)로 주어진다. 이 문제에서 모든 직사각형은 두 꼭짓점의 좌표를 나타내는 4개의 정수 x y p q 로 표현된다. 단 항상 x&lt;p, y&lt;q...","categories": ["BOJ"],
        "tags": ["Algorithm","C++","Geometry"],
        "url": "/boj/2527/",
        "teaser": null
      },{
        "title": "[백준][20157] 화살을 쏘자!",
        "excerpt":"화살을 쏘자! 난이도 골드 5 문제 호준이는 요즘 활 쏘기에 푹 빠져 있다. 열심히 활 쏘기를 연습하던 호준이는 쏠 때 마다 10점이 나오는 경지에 이르렀다. 이렇다 보니 한 방향으로 있는 과녁에 쏘는 것에 실증을 느낀 호준이는 새로운 방식의 활 쏘기를 시도해 보기로 하였다. 화살이 꽂힌 위치에 따라 점수를 얻는 기존의...","categories": ["BOJ"],
        "tags": ["Algorithm","C++","Geometry"],
        "url": "/boj/20157/",
        "teaser": null
      },{
        "title": "[백준][3015] 오아시스 재결합 (작성 중)",
        "excerpt":"오아시스 재결합 난이도 플래티넘 5 문제 오아시스의 재결합 공연에 N명이 한 줄로 서서 기다리고 있다. 이 역사적인 순간을 맞이하기 위해 줄에서서 기다리고 있던 백준이는 갑자기 자기가 볼 수 있는 사람의 수가 궁금해 졌다. 두 사람 A와 B가 서로 볼 수 있으려면, 두 사람 사이에 A 또는 B보다 키가 큰 사람이...","categories": ["BOJ"],
        "tags": ["Algorithm","C++","Stack"],
        "url": "/boj/3015/",
        "teaser": null
      },{
        "title": "[백준][9663] N-Queen",
        "excerpt":"N-Queen 난이도 골드 4 문제 N-Queen 문제는 크기가 N × N인 체스판 위에 퀸 N개를 서로 공격할 수 없게 놓는 문제이다. N이 주어졌을 때, 퀸을 놓는 방법의 수를 구하는 프로그램을 작성하시오. 입력 첫째 줄에 N이 주어진다. (1 ≤ N &lt; 15) 출력 첫째 줄에 퀸 N개를 서로 공격할 수 없게...","categories": ["BOJ"],
        "tags": ["Algorithm","Backtracking","C++"],
        "url": "/boj/9663/",
        "teaser": null
      },{
        "title": "[소프티어] 강의실 배정",
        "excerpt":"강의실 배정 난이도 level 3 문제 김교수는 강의실 1개에 최대한 많은 강의를 배정하려고 한다. 배정된 강의는 서로 겹치지 않아야 하며 수업시간의 길이와 상관없이 최대한 강의를 많이 배정하라. 단, 두 강의의 시작시간과 종료시간은 겹쳐도 된다. 제약조건 1 ≤ N ≤ \\(10^6\\) 인 정수 1 ≤ \\(S_i\\) ＜ \\(F_i\\) ≤ \\(10^9\\) 입력형식...","categories": ["Softeer"],
        "tags": ["Algorithm","C++","Greedy"],
        "url": "/softeer/%EA%B0%95%EC%9D%98%EC%8B%A4%EB%B0%B0%EC%A0%95/",
        "teaser": null
      },{
        "title": "[소프티어] 우물 안 개구리",
        "excerpt":"우물 안 개구리 난이도 level 3 문제 헬스장에서 N명의 회원이 운동을 하고 있다. 각 회원은 1에서 N사이의 번호가 부여되어 있고, i번 회원이 들 수 있는 역기의 무게는 Wi이다. 회원들 사이에는 M개의 친분관계 (Aj, Bj)가 있다. (Aj, Bj)는 Aj번 회원과 Bj번 회원이 친분 관계가 있다는 것을 의미한다. i번 회원은 자신과 친분...","categories": ["Softeer"],
        "tags": ["Algorithm","C++","Implementation"],
        "url": "/softeer/%EC%9A%B0%EB%AC%BC%EC%95%88%EA%B0%9C%EA%B5%AC%EB%A6%AC/",
        "teaser": null
      }]
